/*

Чему равны результаты вычислений:

1.
const a = 5
const b = 10
a++;

let res = a**2 * 5 

2. 
const c = 7
let res2 = (c++ + 5) % 3

3. 
let num1 = 7
let num2 = 3
let res3 = num2 + (num1 = num1 * 5)

4.
Напишите проверку на четность / нечетность любых двух чисел...

5.
let s = 18
let res4 = --s + 7 % 2

6.
// Какой результирующий тип данных мы получим:
let add1 = '5' + 3
let mult1 = '150  ' /  15
let exp1 = '5' -  6 + 10 
let exp2 = ("48" + 12.5) * 3

*Решите все задачи, последовательно выстраивая логику рассуждений. Если есть непонятные моменты, поинтересуйтесь у преподавателя


*/
