/*

1.Проверка любого числа на четность / нечетность. Конструкция if...else
Вначале, Объявите проверяемую переменную!

2. Проверка на кратность числам 3, 5 или 15. 

3. Напишите код, проверяющий возраст гостя, и в зависимости от возраста, определяющий стоимость входного билета на мероприятие:
- до 5 лет - бесплатно;
- от 5 до 18 - 500 рублей;
- от 18 и старше - 1000 рублей.

4. Используя логический оператор ИЛИ (||) напишите проверку на рабочее время офиса
ОФис работает с 10 до 18 включительно! 
Вначале, Объявите переменную текущего времени (целое число от 0 до 24 включительно)

5. Напишите код проверки переменной в заданном диапазоне. Объявите три переменные:
start - начало диапазона (включительно) 
end - конец диапазона (включительно) 
num - проверяемое число  

6. Используя ветвление(условная конструкция), напишите код, реализующий арифметические операции над двумя числами в зависимости от значения оператора:
"plus" -> + 
"sub" -> -
"mult" -> *
"div" -> /
Вначале, объявите три переменные:
num1 - первое число (или другой тип данных)
num2 - второе число (или другой тип данных)
op - оператор

7. Операторы Короткого замыкания. Чему равен результат логического выражения. Прокомментируйте ответ:

let exp = null || 100 && [] || true
let exp = 3 && '' && undefined
let user = "" || 'guest'


*/
